# dict = {"k1":"v1","k2":"v2","k3":"v3"}
# for i in dict:
#     print(i)
# for i in dict:
#     print(dict[i])

# dict.update({"k4":"v4"})
# print(dict)

# Friuts = {
# 	    '苹果':12.3,  # 水果和单价
# 	    '草莓':4.5,
#         '香蕉':6.3,
#         '葡萄':5.8,
#         '橘子':6.4,
#         '樱桃':15.8
# }
# info={
#     '小明':{
#         'fruits':{'苹果':4,'草莓':13,'香蕉':10},
#         'money':0
#     },
#     '小刚':{
#         'fruits':{'葡萄':19, '橘子':12, '樱桃':30},
#         'money':0
#     }
# }
# for i in info['小明']['fruits']:
#     info['小明']['money']=Friuts[i]*info['小明']['fruits'][i]
#     info['小明']['money']+=info['小明']['money']
# print("小明的水果价格为",info['小明']['money'])
# for j in info['小刚']['fruits']:
#     info['小刚']['money']=Friuts[j]*info['小刚']['fruits'][j]
#     info['小刚']['money']+=info['小刚']['money']
# print("小刚的水果价格为",info['小刚']['money'])

# num={21:3,56:9,10:3}



# a1={'刘备':{'年龄':56,'性别':'男','编号':106,'任职公司':'IBM','薪资':500,'部门编号':50}}
# a2={'大乔':{'年龄':19,'性别':'女','编号':230,'任职公司':'微软','薪资':501,'部门编号':60}}
# a3={'小乔':{'年龄':19,'性别':'女','编号':210,'任职公司':'Oracle','薪资':600,'部门编号':60}}
# a4={'张飞':{'年龄':45,'性别':'男','编号':230,'任职公司':'Tencent','薪资':700,'部门编号':10}}